contiki-os/contiki/cc26xxware/inc/hw_rfc_dbell.h
// Field: [23]    RX_ENTRY_DONE
//
// Interrupt enable for RFCPEIFG.RX_ENTRY_DONE.
#define RFC_DBELL_RFCPEIEN_RX_ENTRY_DONE                            0x00800000
#define RFC_DBELL_RFCPEIEN_RX_ENTRY_DONE_BITN                       23
#define RFC_DBELL_RFCPEIEN_RX_ENTRY_DONE_M                          0x00800000
#define RFC_DBELL_RFCPEIEN_RX_ENTRY_DONE_S                          23

// Field: [22]    RX_BUF_FULL
//
// Interrupt enable for RFCPEIFG.RX_BUF_FULL.
#define RFC_DBELL_RFCPEIEN_RX_BUF_FULL                              0x00400000
#define RFC_DBELL_RFCPEIEN_RX_BUF_FULL_BITN                         22
#define RFC_DBELL_RFCPEIEN_RX_BUF_FULL_M                            0x00400000
#define RFC_DBELL_RFCPEIEN_RX_BUF_FULL_S                            22

// Field: [21]    RX_CTRL_ACK
//
// Interrupt enable for RFCPEIFG.RX_CTRL_ACK.
#define RFC_DBELL_RFCPEIEN_RX_CTRL_ACK                              0x00200000
#define RFC_DBELL_RFCPEIEN_RX_CTRL_ACK_BITN                         21
#define RFC_DBELL_RFCPEIEN_RX_CTRL_ACK_M                            0x00200000
#define RFC_DBELL_RFCPEIEN_RX_CTRL_ACK_S                            21

// Field: [20]    RX_CTRL
//
// Interrupt enable for RFCPEIFG.RX_CTRL.
#define RFC_DBELL_RFCPEIEN_RX_CTRL                                  0x00100000
#define RFC_DBELL_RFCPEIEN_RX_CTRL_BITN                             20
#define RFC_DBELL_RFCPEIEN_RX_CTRL_M                                0x00100000
#define RFC_DBELL_RFCPEIEN_RX_CTRL_S                                20

// Field: [19]    RX_EMPTY
//
// Interrupt enable for RFCPEIFG.RX_EMPTY.
#define RFC_DBELL_RFCPEIEN_RX_EMPTY                                 0x00080000
#define RFC_DBELL_RFCPEIEN_RX_EMPTY_BITN                            19
#define RFC_DBELL_RFCPEIEN_RX_EMPTY_M                               0x00080000
#define RFC_DBELL_RFCPEIEN_RX_EMPTY_S                               19

// Field: [18]    RX_IGNORED
//
// Interrupt enable for RFCPEIFG.RX_IGNORED.
#define RFC_DBELL_RFCPEIEN_RX_IGNORED                               0x00040000
#define RFC_DBELL_RFCPEIEN_RX_IGNORED_BITN                          18
#define RFC_DBELL_RFCPEIEN_RX_IGNORED_M                             0x00040000
#define RFC_DBELL_RFCPEIEN_RX_IGNORED_S                             18

// Field: [17]    RX_NOK
//
// Interrupt enable for RFCPEIFG.RX_NOK.
#define RFC_DBELL_RFCPEIEN_RX_NOK                                   0x00020000
#define RFC_DBELL_RFCPEIEN_RX_NOK_BITN                              17
#define RFC_DBELL_RFCPEIEN_RX_NOK_M                                 0x00020000
#define RFC_DBELL_RFCPEIEN_RX_NOK_S                                 17

// Field: [16]    RX_OK
//
// Interrupt enable for RFCPEIFG.RX_OK.
#define RFC_DBELL_RFCPEIEN_RX_OK                                    0x00010000
#define RFC_DBELL_RFCPEIEN_RX_OK_BITN                               16
#define RFC_DBELL_RFCPEIEN_RX_OK_M                                  0x00010000
#define RFC_DBELL_RFCPEIEN_RX_OK_S                                  16

// Field: [15]    IRQ15
//
// Interrupt enable for RFCPEIFG.IRQ15.
#define RFC_DBELL_RFCPEIEN_IRQ15                                    0x00008000
#define RFC_DBELL_RFCPEIEN_IRQ15_BITN                               15
#define RFC_DBELL_RFCPEIEN_IRQ15_M                                  0x00008000
#define RFC_DBELL_RFCPEIEN_IRQ15_S                                  15

// Field: [14]    IRQ14
//
// Interrupt enable for RFCPEIFG.IRQ14.
#define RFC_DBELL_RFCPEIEN_IRQ14                                    0x00004000
#define RFC_DBELL_RFCPEIEN_IRQ14_BITN                               14
#define RFC_DBELL_RFCPEIEN_IRQ14_M                                  0x00004000
#define RFC_DBELL_RFCPEIEN_IRQ14_S                                  14

// Field: [13]    IRQ13
//
// Interrupt enable for RFCPEIFG.IRQ13.
#define RFC_DBELL_RFCPEIEN_IRQ13                                    0x00002000
#define RFC_DBELL_RFCPEIEN_IRQ13_BITN                               13
#define RFC_DBELL_RFCPEIEN_IRQ13_M                                  0x00002000
#define RFC_DBELL_RFCPEIEN_IRQ13_S                                  13

// Field: [12]    BG_COMMAND_SUSPENDED
//
// Interrupt enable for RFCPEIFG.BG_COMMAND_SUSPENDED.
#define RFC_DBELL_RFCPEIEN_BG_COMMAND_SUSPENDED                     0x00001000
#define RFC_DBELL_RFCPEIEN_BG_COMMAND_SUSPENDED_BITN                12
#define RFC_DBELL_RFCPEIEN_BG_COMMAND_SUSPENDED_M                   0x00001000
#define RFC_DBELL_RFCPEIEN_BG_COMMAND_SUSPENDED_S                   12

// Field: [11]    TX_BUFFER_CHANGED
//
// Interrupt enable for RFCPEIFG.TX_BUFFER_CHANGED.
#define RFC_DBELL_RFCPEIEN_TX_BUFFER_CHANGED                        0x00000800
#define RFC_DBELL_RFCPEIEN_TX_BUFFER_CHANGED_BITN                   11
#define RFC_DBELL_RFCPEIEN_TX_BUFFER_CHANGED_M                      0x00000800
#define RFC_DBELL_RFCPEIEN_TX_BUFFER_CHANGED_S                      11

// Field: [10]    TX_ENTRY_DONE
//
// Interrupt enable for RFCPEIFG.TX_ENTRY_DONE.
#define RFC_DBELL_RFCPEIEN_TX_ENTRY_DONE                            0x00000400
#define RFC_DBELL_RFCPEIEN_TX_ENTRY_DONE_BITN                       10
#define RFC_DBELL_RFCPEIEN_TX_ENTRY_DONE_M                          0x00000400
#define RFC_DBELL_RFCPEIEN_TX_ENTRY_DONE_S                          10

// Field: [9]    TX_RETRANS
//
// Interrupt enable for RFCPEIFG.TX_RETRANS.
#define RFC_DBELL_RFCPEIEN_TX_RETRANS                               0x00000200
#define RFC_DBELL_RFCPEIEN_TX_RETRANS_BITN                          9
#define RFC_DBELL_RFCPEIEN_TX_RETRANS_M                             0x00000200
#define RFC_DBELL_RFCPEIEN_TX_RETRANS_S                             9

// Field: [8]    TX_CTRL_ACK_ACK
//
// Interrupt enable for RFCPEIFG.TX_CTRL_ACK_ACK.
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_ACK                          0x00000100
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_ACK_BITN                     8
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_ACK_M                        0x00000100
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_ACK_S                        8

// Field: [7]    TX_CTRL_ACK
//
// Interrupt enable for RFCPEIFG.TX_CTRL_ACK.
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK                              0x00000080
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_BITN                         7
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_M                            0x00000080
#define RFC_DBELL_RFCPEIEN_TX_CTRL_ACK_S                            7

// Field: [6]    TX_CTRL
//
// Interrupt enable for RFCPEIFG.TX_CTRL.
#define RFC_DBELL_RFCPEIEN_TX_CTRL                                  0x00000040
#define RFC_DBELL_RFCPEIEN_TX_CTRL_BITN                             6
#define RFC_DBELL_RFCPEIEN_TX_CTRL_M                                0x00000040
#define RFC_DBELL_RFCPEIEN_TX_CTRL_S                                6

