contiki-os/contiki/cc26xxware/inc/hw_rfc_dbell.h
// Field: [23]    RX_ENTRY_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.RX_ENTRY_DONE interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE                            0x00800000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_BITN                       23
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_M                          0x00800000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_S                          23
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_CPE0                       0x00000000
#define RFC_DBELL_RFCPEISL_RX_ENTRY_DONE_CPE1                       0x00800000

// Field: [22]    RX_BUF_FULL
//
// Select which CPU interrupt vector the RFCPEIFG.RX_BUF_FULL interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL                              0x00400000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_BITN                         22
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_M                            0x00400000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_S                            22
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_CPE0                         0x00000000
#define RFC_DBELL_RFCPEISL_RX_BUF_FULL_CPE1                         0x00400000

// Field: [21]    RX_CTRL_ACK
//
// Select which CPU interrupt vector the RFCPEIFG.RX_CTRL_ACK interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK                              0x00200000
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK_BITN                         21
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK_M                            0x00200000
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK_S                            21
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK_CPE0                         0x00000000
#define RFC_DBELL_RFCPEISL_RX_CTRL_ACK_CPE1                         0x00200000

// Field: [20]    RX_CTRL
//
// Select which CPU interrupt vector the RFCPEIFG.RX_CTRL interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_CTRL                                  0x00100000
#define RFC_DBELL_RFCPEISL_RX_CTRL_BITN                             20
#define RFC_DBELL_RFCPEISL_RX_CTRL_M                                0x00100000
#define RFC_DBELL_RFCPEISL_RX_CTRL_S                                20
#define RFC_DBELL_RFCPEISL_RX_CTRL_CPE0                             0x00000000
#define RFC_DBELL_RFCPEISL_RX_CTRL_CPE1                             0x00100000

// Field: [19]    RX_EMPTY
//
// Select which CPU interrupt vector the RFCPEIFG.RX_EMPTY interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_EMPTY                                 0x00080000
#define RFC_DBELL_RFCPEISL_RX_EMPTY_BITN                            19
#define RFC_DBELL_RFCPEISL_RX_EMPTY_M                               0x00080000
#define RFC_DBELL_RFCPEISL_RX_EMPTY_S                               19
#define RFC_DBELL_RFCPEISL_RX_EMPTY_CPE0                            0x00000000
#define RFC_DBELL_RFCPEISL_RX_EMPTY_CPE1                            0x00080000

// Field: [18]    RX_IGNORED
//
// Select which CPU interrupt vector the RFCPEIFG.RX_IGNORED interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_IGNORED                               0x00040000
#define RFC_DBELL_RFCPEISL_RX_IGNORED_BITN                          18
#define RFC_DBELL_RFCPEISL_RX_IGNORED_M                             0x00040000
#define RFC_DBELL_RFCPEISL_RX_IGNORED_S                             18
#define RFC_DBELL_RFCPEISL_RX_IGNORED_CPE0                          0x00000000
#define RFC_DBELL_RFCPEISL_RX_IGNORED_CPE1                          0x00040000

// Field: [17]    RX_NOK
//
// Select which CPU interrupt vector the RFCPEIFG.RX_NOK interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_NOK                                   0x00020000
#define RFC_DBELL_RFCPEISL_RX_NOK_BITN                              17
#define RFC_DBELL_RFCPEISL_RX_NOK_M                                 0x00020000
#define RFC_DBELL_RFCPEISL_RX_NOK_S                                 17
#define RFC_DBELL_RFCPEISL_RX_NOK_CPE0                              0x00000000
#define RFC_DBELL_RFCPEISL_RX_NOK_CPE1                              0x00020000

// Field: [16]    RX_OK
//
// Select which CPU interrupt vector the RFCPEIFG.RX_OK interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_RX_OK                                    0x00010000
#define RFC_DBELL_RFCPEISL_RX_OK_BITN                               16
#define RFC_DBELL_RFCPEISL_RX_OK_M                                  0x00010000
#define RFC_DBELL_RFCPEISL_RX_OK_S                                  16
#define RFC_DBELL_RFCPEISL_RX_OK_CPE0                               0x00000000
#define RFC_DBELL_RFCPEISL_RX_OK_CPE1                               0x00010000

// Field: [15]    IRQ15
//
// Select which CPU interrupt vector the RFCPEIFG.IRQ15 interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_IRQ15                                    0x00008000
#define RFC_DBELL_RFCPEISL_IRQ15_BITN                               15
#define RFC_DBELL_RFCPEISL_IRQ15_M                                  0x00008000
#define RFC_DBELL_RFCPEISL_IRQ15_S                                  15
#define RFC_DBELL_RFCPEISL_IRQ15_CPE0                               0x00000000
#define RFC_DBELL_RFCPEISL_IRQ15_CPE1                               0x00008000

// Field: [14]    IRQ14
//
// Select which CPU interrupt vector the RFCPEIFG.IRQ14 interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_IRQ14                                    0x00004000
#define RFC_DBELL_RFCPEISL_IRQ14_BITN                               14
#define RFC_DBELL_RFCPEISL_IRQ14_M                                  0x00004000
#define RFC_DBELL_RFCPEISL_IRQ14_S                                  14
#define RFC_DBELL_RFCPEISL_IRQ14_CPE0                               0x00000000
#define RFC_DBELL_RFCPEISL_IRQ14_CPE1                               0x00004000

// Field: [13]    IRQ13
//
// Select which CPU interrupt vector the RFCPEIFG.IRQ13 interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_IRQ13                                    0x00002000
#define RFC_DBELL_RFCPEISL_IRQ13_BITN                               13
#define RFC_DBELL_RFCPEISL_IRQ13_M                                  0x00002000
#define RFC_DBELL_RFCPEISL_IRQ13_S                                  13
#define RFC_DBELL_RFCPEISL_IRQ13_CPE0                               0x00000000
#define RFC_DBELL_RFCPEISL_IRQ13_CPE1                               0x00002000

// Field: [12]    BG_COMMAND_SUSPENDED
//
// Select which CPU interrupt vector the RFCPEIFG.BG_COMMAND_SUSPENDED interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED                     0x00001000
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED_BITN                12
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED_M                   0x00001000
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED_S                   12
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED_CPE0                0x00000000
#define RFC_DBELL_RFCPEISL_BG_COMMAND_SUSPENDED_CPE1                0x00001000

