contiki-os/contiki/cc26xxware/inc/hw_rfc_dbell.h
// Field: [11]    TX_BUFFER_CHANGED
//
// Select which CPU interrupt vector the RFCPEIFG.TX_BUFFER_CHANGED interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED                        0x00000800
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED_BITN                   11
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED_M                      0x00000800
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED_S                      11
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED_CPE0                   0x00000000
#define RFC_DBELL_RFCPEISL_TX_BUFFER_CHANGED_CPE1                   0x00000800

// Field: [10]    TX_ENTRY_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.TX_ENTRY_DONE interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE                            0x00000400
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE_BITN                       10
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE_M                          0x00000400
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE_S                          10
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE_CPE0                       0x00000000
#define RFC_DBELL_RFCPEISL_TX_ENTRY_DONE_CPE1                       0x00000400

// Field: [9]    TX_RETRANS
//
// Select which CPU interrupt vector the RFCPEIFG.TX_RETRANS interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_RETRANS                               0x00000200
#define RFC_DBELL_RFCPEISL_TX_RETRANS_BITN                          9
#define RFC_DBELL_RFCPEISL_TX_RETRANS_M                             0x00000200
#define RFC_DBELL_RFCPEISL_TX_RETRANS_S                             9
#define RFC_DBELL_RFCPEISL_TX_RETRANS_CPE0                          0x00000000
#define RFC_DBELL_RFCPEISL_TX_RETRANS_CPE1                          0x00000200

// Field: [8]    TX_CTRL_ACK_ACK
//
// Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK_ACK interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK                          0x00000100
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK_BITN                     8
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK_M                        0x00000100
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK_S                        8
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK_CPE0                     0x00000000
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_ACK_CPE1                     0x00000100

// Field: [7]    TX_CTRL_ACK
//
// Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK                              0x00000080
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_BITN                         7
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_M                            0x00000080
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_S                            7
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_CPE0                         0x00000000
#define RFC_DBELL_RFCPEISL_TX_CTRL_ACK_CPE1                         0x00000080

// Field: [6]    TX_CTRL
//
// Select which CPU interrupt vector the RFCPEIFG.TX_CTRL interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_CTRL                                  0x00000040
#define RFC_DBELL_RFCPEISL_TX_CTRL_BITN                             6
#define RFC_DBELL_RFCPEISL_TX_CTRL_M                                0x00000040
#define RFC_DBELL_RFCPEISL_TX_CTRL_S                                6
#define RFC_DBELL_RFCPEISL_TX_CTRL_CPE0                             0x00000000
#define RFC_DBELL_RFCPEISL_TX_CTRL_CPE1                             0x00000040

// Field: [5]    TX_ACK
//
// Select which CPU interrupt vector the RFCPEIFG.TX_ACK interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_ACK                                   0x00000020
#define RFC_DBELL_RFCPEISL_TX_ACK_BITN                              5
#define RFC_DBELL_RFCPEISL_TX_ACK_M                                 0x00000020
#define RFC_DBELL_RFCPEISL_TX_ACK_S                                 5
#define RFC_DBELL_RFCPEISL_TX_ACK_CPE0                              0x00000000
#define RFC_DBELL_RFCPEISL_TX_ACK_CPE1                              0x00000020

// Field: [4]    TX_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.TX_DONE interrupt should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_TX_DONE                                  0x00000010
#define RFC_DBELL_RFCPEISL_TX_DONE_BITN                             4
#define RFC_DBELL_RFCPEISL_TX_DONE_M                                0x00000010
#define RFC_DBELL_RFCPEISL_TX_DONE_S                                4
#define RFC_DBELL_RFCPEISL_TX_DONE_CPE0                             0x00000000
#define RFC_DBELL_RFCPEISL_TX_DONE_CPE1                             0x00000010

// Field: [3]    LAST_FG_COMMAND_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.LAST_FG_COMMAND_DONE interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE                     0x00000008
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE_BITN                3
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE_M                   0x00000008
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE_S                   3
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE_CPE0                0x00000000
#define RFC_DBELL_RFCPEISL_LAST_FG_COMMAND_DONE_CPE1                0x00000008

// Field: [2]    FG_COMMAND_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.FG_COMMAND_DONE interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE                          0x00000004
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE_BITN                     2
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE_M                        0x00000004
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE_S                        2
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE_CPE0                     0x00000000
#define RFC_DBELL_RFCPEISL_FG_COMMAND_DONE_CPE1                     0x00000004

