contiki-os/contiki/cc26xxware/inc/hw_rfc_dbell.h
// Field: [1]    LAST_COMMAND_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.LAST_COMMAND_DONE interrupt
// should use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE                        0x00000002
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE_BITN                   1
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE_M                      0x00000002
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE_S                      1
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE_CPE0                   0x00000000
#define RFC_DBELL_RFCPEISL_LAST_COMMAND_DONE_CPE1                   0x00000002

// Field: [0]    COMMAND_DONE
//
// Select which CPU interrupt vector the RFCPEIFG.COMMAND_DONE interrupt should
// use.
// ENUMs:
// CPE0                 Associate this interrupt line with INT_RF_CPE0 interrupt
// vector
// CPE1                 Associate this interrupt line with INT_RF_CPE1 interrupt
// vector
//
#define RFC_DBELL_RFCPEISL_COMMAND_DONE                             0x00000001
#define RFC_DBELL_RFCPEISL_COMMAND_DONE_BITN                        0
#define RFC_DBELL_RFCPEISL_COMMAND_DONE_M                           0x00000001
#define RFC_DBELL_RFCPEISL_COMMAND_DONE_S                           0
#define RFC_DBELL_RFCPEISL_COMMAND_DONE_CPE0                        0x00000000
#define RFC_DBELL_RFCPEISL_COMMAND_DONE_CPE1                        0x00000001

//*****************************************************************************
//
// Register: RFC_DBELL_O_RFACKIFG
//
//*****************************************************************************
// Field: [0]    ACKFLAG
//
// Interrupt flag for Command ACK
#define RFC_DBELL_RFACKIFG_ACKFLAG                                  0x00000001
#define RFC_DBELL_RFACKIFG_ACKFLAG_BITN                             0
#define RFC_DBELL_RFACKIFG_ACKFLAG_M                                0x00000001
#define RFC_DBELL_RFACKIFG_ACKFLAG_S                                0

//*****************************************************************************
//
// Register: RFC_DBELL_O_SYSGPOCTL
//
//*****************************************************************************
// Field: [15:12] GPOCTL3
//
// RF Core GPO control bit 3. Selects which signal to output on the RF Core GPO
// line 3.
// ENUMs:
// CPEGPO0              CPE GPO line 0
// CPEGPO1              CPE GPO line 1
// CPEGPO2              CPE GPO line 2
// CPEGPO3              CPE GPO line 3
// MCEGPO0              MCE GPO line 0
// MCEGPO1              MCE GPO line 1
// MCEGPO2              MCE GPO line 2
// MCEGPO3              MCE GPO line 3
// RFEGPO0              RFE GPO line 0
// RFEGPO1              RFE GPO line 1
// RFEGPO2              RFE GPO line 2
// RFEGPO3              RFE GPO line 3
// RATGPO0              RAT GPO line 0
// RATGPO1              RAT GPO line 1
// RATGPO2              RAT GPO line 2
// RATGPO3              RAT GPO line 3
//
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_M                               0x0000F000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_S                               12
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_CPEGPO0                         0x00000000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_CPEGPO1                         0x00001000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_CPEGPO2                         0x00002000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_CPEGPO3                         0x00003000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_MCEGPO0                         0x00004000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_MCEGPO1                         0x00005000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_MCEGPO2                         0x00006000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_MCEGPO3                         0x00007000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RFEGPO0                         0x00008000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RFEGPO1                         0x00009000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RFEGPO2                         0x0000A000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RFEGPO3                         0x0000B000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RATGPO0                         0x0000C000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RATGPO1                         0x0000D000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RATGPO2                         0x0000E000
#define RFC_DBELL_SYSGPOCTL_GPOCTL3_RATGPO3                         0x0000F000

// Field: [11:8] GPOCTL2
//
// RF Core GPO control bit 2. Selects which signal to output on the RF Core GPO
// line 2.
// ENUMs:
// CPEGPO0              CPE GPO line 0
// CPEGPO1              CPE GPO line 1
// CPEGPO2              CPE GPO line 2
// CPEGPO3              CPE GPO line 3
// MCEGPO0              MCE GPO line 0
// MCEGPO1              MCE GPO line 1
// MCEGPO2              MCE GPO line 2
// MCEGPO3              MCE GPO line 3
// RFEGPO0              RFE GPO line 0
// RFEGPO1              RFE GPO line 1
// RFEGPO2              RFE GPO line 2
// RFEGPO3              RFE GPO line 3
// RATGPO0              RAT GPO line 0
// RATGPO1              RAT GPO line 1
// RATGPO2              RAT GPO line 2
// RATGPO3              RAT GPO line 3
//
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_M                               0x00000F00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_S                               8
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_CPEGPO0                         0x00000000
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_CPEGPO1                         0x00000100
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_CPEGPO2                         0x00000200
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_CPEGPO3                         0x00000300
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_MCEGPO0                         0x00000400
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_MCEGPO1                         0x00000500
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_MCEGPO2                         0x00000600
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_MCEGPO3                         0x00000700
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RFEGPO0                         0x00000800
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RFEGPO1                         0x00000900
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RFEGPO2                         0x00000A00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RFEGPO3                         0x00000B00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RATGPO0                         0x00000C00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RATGPO1                         0x00000D00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RATGPO2                         0x00000E00
#define RFC_DBELL_SYSGPOCTL_GPOCTL2_RATGPO3                         0x00000F00

// Field: [7:4] GPOCTL1
//
// RF Core GPO control bit 1. Selects which signal to output on the RF Core GPO
// line 1.
// ENUMs:
// CPEGPO0              CPE GPO line 0
// CPEGPO1              CPE GPO line 1
// CPEGPO2              CPE GPO line 2
// CPEGPO3              CPE GPO line 3
// MCEGPO0              MCE GPO line 0
// MCEGPO1              MCE GPO line 1
// MCEGPO2              MCE GPO line 2
// MCEGPO3              MCE GPO line 3
// RFEGPO0              RFE GPO line 0
// RFEGPO1              RFE GPO line 1
// RFEGPO2              RFE GPO line 2
// RFEGPO3              RFE GPO line 3
// RATGPO0              RAT GPO line 0
// RATGPO1              RAT GPO line 1
// RATGPO2              RAT GPO line 2
// RATGPO3              RAT GPO line 3
//
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_M                               0x000000F0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_S                               4
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_CPEGPO0                         0x00000000
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_CPEGPO1                         0x00000010
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_CPEGPO2                         0x00000020
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_CPEGPO3                         0x00000030
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_MCEGPO0                         0x00000040
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_MCEGPO1                         0x00000050
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_MCEGPO2                         0x00000060
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_MCEGPO3                         0x00000070
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RFEGPO0                         0x00000080
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RFEGPO1                         0x00000090
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RFEGPO2                         0x000000A0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RFEGPO3                         0x000000B0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RATGPO0                         0x000000C0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RATGPO1                         0x000000D0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RATGPO2                         0x000000E0
#define RFC_DBELL_SYSGPOCTL_GPOCTL1_RATGPO3                         0x000000F0

// Field: [3:0] GPOCTL0
//
// RF Core GPO control bit 0. Selects which signal to output on the RF Core GPO
// line 0.
// ENUMs:
// CPEGPO0              CPE GPO line 0
// CPEGPO1              CPE GPO line 1
// CPEGPO2              CPE GPO line 2
// CPEGPO3              CPE GPO line 3
// MCEGPO0              MCE GPO line 0
// MCEGPO1              MCE GPO line 1
// MCEGPO2              MCE GPO line 2
// MCEGPO3              MCE GPO line 3
// RFEGPO0              RFE GPO line 0
// RFEGPO1              RFE GPO line 1
// RFEGPO2              RFE GPO line 2
// RFEGPO3              RFE GPO line 3
// RATGPO0              RAT GPO line 0
// RATGPO1              RAT GPO line 1
// RATGPO2              RAT GPO line 2
// RATGPO3              RAT GPO line 3
//
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_M                               0x0000000F
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_S                               0
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO0                         0x00000000
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO1                         0x00000001
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO2                         0x00000002
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_CPEGPO3                         0x00000003
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO0                         0x00000004
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO1                         0x00000005
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO2                         0x00000006
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_MCEGPO3                         0x00000007
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO0                         0x00000008
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO1                         0x00000009
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO2                         0x0000000A
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RFEGPO3                         0x0000000B
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO0                         0x0000000C
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO1                         0x0000000D
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO2                         0x0000000E
#define RFC_DBELL_SYSGPOCTL_GPOCTL0_RATGPO3                         0x0000000F

#endif // __HW_RFC_DBELL_H__
